package main

import (
	"context"
	"fmt"
	"math/rand"
	"os"
	"regexp"
	"strings"
	"time"

	texttospeech "cloud.google.com/go/texttospeech/apiv1"
	"google.golang.org/api/option"
)

const (
	tw        = "_lang_tw_"
	se        = "_lang_se_"
	en        = "_lang_en_"
	fi        = "_lang_fi_"
	nextVoice = "_next_voice_"
)

func generateMandarin(ns rawTextInput) error {
	rand.Seed(time.Now().UnixNano())
	randInt := rand.Int()
	ctx := context.Background()
	opt := option.WithCredentialsFile("serviceAccount.json")
	fmt.Println(opt)

	client, err := texttospeech.NewClient(ctx, opt)
	if err != nil {
		return err
	}
	voices := newVoices()
	sentence := strings.ReplaceAll(ns.sentence, "\t", "")
	sentence = strings.ReplaceAll(sentence, "\n", "")
	seps := regexp.MustCompile(`[,|.|:|?|!|.]`)
	splitIt := seps.Split(sentence, -1)
	data := []inputItem{}
	voicesLen := len(voices.tw)
	voiceIndex := randInt % voicesLen
	voice := voices.tw[voiceIndex]
	for i, v := range splitIt {
		if v == "" {
			continue
		}
		if strings.Contains(v, en) {
			voice = voices.en
			v = strings.ReplaceAll(v, en, "")
		} else if strings.Contains(v, tw) {
			voice = voices.tw[voiceIndex]
			v = strings.ReplaceAll(v, tw, "")
		} else if strings.Contains(v, nextVoice) {
			voiceIndex++
			voiceIndex = voiceIndex % voicesLen
			voice = voices.tw[voiceIndex]
			v = strings.ReplaceAll(v, nextVoice, "")
		}
		audio := inputItem{sentence: v, id: fmt.Sprintf("%d_1", i), voice: voice}
		if strings.Count(v, "_") == 0 {
			audio.voice = voices.twNorepeat
		}
		data = append(data, audio)
	}
	var audioContent []byte
	for _, v := range data {
		rmWhiteSpace := strings.TrimSpace(v.sentence)
		v.sentence = strings.ReplaceAll(v.sentence, "_", "")

		reqAudio := audioRequest(v, "cmn-TW")
		respAudio, err := client.SynthesizeSpeech(ctx, reqAudio)
		if err != nil {
			return err
		}
		count := strings.Count(rmWhiteSpace, "_")
		if count == 0 {
			audioContent = append(audioContent, respAudio.AudioContent...)
		} else {
			quietAudio := makeQuietAudio(len(respAudio.AudioContent))
			for i := 0; i < count; i++ {
				audioContent = append(audioContent, respAudio.AudioContent...)
				audioContent = append(audioContent, quietAudio...)
			}

		}
		fmt.Printf("Wrote audio to []byte: %v\n", v.id)
	}
	path := "C:/Users/FIJUSAU/go/src/langExGen/s2/"
	filePath := path + ns.name + ".mp3"
	err = os.WriteFile(filePath, audioContent, 0644)
	if err != nil {
		return err
	}
	return nil
}

// More RTI reports: https://www.rti.org.tw/news/categoryPodcast/categoryId/3
// https://dts.podtrac.com/redirect.mp3/chrt.fm/track/FC2CAF/static.rti.org.tw/assets/audio/2024/04/30/a61d7683db1b744457db95560747a8a6.mp3

type rawTextInput struct {
	name     string
	sentence string
}

var theVictim = rawTextInput{"theVictim", `
___Netflix續約《誰是被害者2》6/21上線 主演爆料精彩內容.
___誰是被害者 第1季2020年播映時就獲得好評, ___4年後; 第2季將於6月21日正式上線, ___這也是Netflix首部續約華語原創影集. 
___除了主演張孝全; 許瑋甯; 王識賢, __李沐再度合體, __還加入特別嘉賓蘇慧倫. 
__4人今天首度與媒體見面, __爆料第2季精彩內容, __強調第2季更燒腦, __更刺激; 也更人性; 值得觀眾期待. 

`}

// 《誰是被害者》第1季2020年播映時就獲得好評，4年後，第2季將於6月21日正式上線，這也是Netflix首部續約華語原創影集。除了主演張孝全、許瑋甯、王識賢、李沐再度合體，還加入特別嘉賓蘇慧倫。4人今天(11日)首度與媒體見面，爆料第2季精彩內容，強調第2季更燒腦、更刺激，也更人性，值得觀眾期待。#央廣記者江昭倫報導#</p> <p>集結監製曾瀚賢，製作人湯昇榮、徐國倫，導演莊絢維、陳冠仲，以及張孝全、許瑋甯、王識賢、李沐等原班人馬的台灣原創影集《誰是被害者》又回來了，在第2季中，還加入了蘇慧倫、藤岡靛以及劉俊謙等卡司，共同捲入一起全新命案。</p> <p>由張孝全飾演的亞斯伯格症的前鑑識官方毅任，在全新一季中除了變成頭號嫌疑犯，延續首季結尾，和相隔多年再重逢的女兒李沐嘗試一起展開新生活，甚至和飾演徐海茵的許瑋甯從辦案夥伴成了戀人。</p> <p>張孝全說，關於他與許瑋甯的在片中的互動，其實就是一個兩性關係的溝通問題，非常真實，他也透露也第2季裡有很多關於行兇細節，很震撼，演員們角色的成長和改變也很不一樣。張孝全：『(原音)我覺得第2季的案件訊息量比第一季大更多，我覺得第2季每個人物，除了方毅任之外，每個人都有很大的改變跟不同的面向可以被看見，我覺得值得被期待。』</p> <p>在新一季中，許瑋甯的角色職業從記者變成基金會的公關，但面對不善表達的另一半方毅任，許瑋甯總有一種自己還是單身的錯覺。不過相隔4年，許瑋甯說，拍戲時與張孝全的默契很快就找回來，甚至還常笑場。許瑋甯：『(原音)壓力大不大？就是當然會希望更完美呈現，把這個角色做得更完整，因為等於我們所有角色都有一個成長曲線軸，他已經往那個方向蛻變不一樣，所以我們詮釋的方式跟遇到的狀況也不一樣，包括大家的工作環境也都不太一樣，所以，不會！我記得我至少每次跟孝全對戲的時候，我們就很容易會笑場。』</p> <p>在第1季中，李沐與張孝全的父女關係是很大重頭戲，第2季，兩父女嘗試一起生活，也經歷很多磨合過程。李沐說，新一季內容很多命案現場會讓她在拍戲時感到反胃，但也強調張孝全就是能讓現場變得很開心，拍攝過程非常順利。</p> <p>第2季的一大亮點就是加入了由蘇慧倫飾演的法醫角色，這也是蘇慧倫與張孝全相隔快20年再度合作。談到首次挑戰法醫角色，蘇慧倫事前還向真正法醫請教工作內容和細節，沒想到法醫突然當場拿出命案現場照片，讓她覺得很驚悚，不過也因為是平常不會接觸的職業，是很特別拍戲經驗。</p> <p>相比第1季，演員們不約而同表示，《誰是被害者2》更燒腦、更人性，也更療癒，每段情感關係也有所成長，還加入很多錯綜複雜的故事和厲害的角色，觀眾看戲時應該會獲得很多刺激和興奮感。

// _lang_en_ _risk factor. _lang_tw_ _風險係數.
// _lang_en_ _idiom about discounts. _lang_tw_ _七折八扣.

// 環境部昨天預告碳費相關3子法, 除了設有二点5萬噸扣除額; 優惠費率, _還可享有高碳洩漏風險係數; 幫排放量打折.
// _lang_en_ _staged increase. _lang_tw_ __階段性調升.
// _lang_en_ _exemption amount. _lang_tw_ __免徵額度.
// _lang_en_ _starting price. _lang_tw_ _起徵價.

// 對此; 環保團體今天發布聯合聲明, 批評環境部做法是學半套, _屆時國內產業出口歐盟仍要購買憑證, _呼籲盡快制訂碳費費率, __起徵價新台幣500元並階段性調升.
// _央廣記者劉品希的採訪報導, _環境部29日預告碳費相關3子法, __碳費收費辦法減免再優惠,
// __明定二点5萬噸免徵額度, ___高碳洩漏風險事業若達自主減量指定目標, 排放量打2折,
// __再適用優惠費率; 環團認為碳費七折八扣, _促進產業減碳力道非常有限.

// _lang_en_ _project. _lang_tw_ _專案.
// _lang_en_ _might as well not exist. _lang_tw_ __形同虛設.
// _lang_en_ _rate level. _lang_tw_ __費率水準.

// ___綠色和平氣候與能源專案主任徐祥誠30日受訪表示, __碳洩漏風險係數為企業開減價後門, __雖然這些企業不適用二点5萬噸扣除額,
// ___但在各期適用0点2; 0点4; 0点6的碳洩漏風險係數值, __恐讓減碳效果大打折扣.

// _lang_en_ _depend on. _lang_tw_ _取決於.

// 他強調, ___企業的減碳動機仍取決於碳費費率的高低, ___若最終碳費起徵費率不足新台幣500元, __恐讓碳費制度形同虛設.
// 他說, ___那既然現在有這麼多樣子的算是碳費抵免的這樣的制度,
// _那我們這邊是認為, ___現在看起來勢必是必須要有一個一定的碳費費率水準, __才有辦法達到真正這樣減碳的效果.
// _lang_en_ _professional lawyer. _lang_tw_ _專職律師.

var 體育署 = rawTextInput{"體育署", `
台北大學自然資源與環境管理研究所教授李堅明則表示, 徵收碳費是減碳工具; 而非為了財政目的,

_lang_en_ _Stop opening back doors for companies to avoid their obligations. _lang_tw_ __停止大開企業規避義務的後門.
_lang_en_ _Hope that loopholes in carbon fee regulations will be corrected. _lang_tw_ __希望修正碳費規範漏洞.

__他認為產業若已花錢投入減碳工作; 達到自主減量的指定目標, _便應全部免徵碳費; 這才公平.

_體育署何時升格成部? _鄭英耀; 預計年底前報行政院.
_lang_en_ _inaugural speech. _lang_tw_ __就職演說.
_lang_en_ _drafted multiple versions. _lang_tw_ __擬定多個版本.

賴清德總統在520就職演說中表示, 他期待一個更健康的臺灣, __將成立 體育暨運動發展部; 推展全民運動. 
_針對體育署升格成部的計畫, _教育部長鄭英耀今天在立法院表示, 目前已擬定多個版本, __單獨成部; 或者跟別的部門合併成一個部會, 
都是有可能的, _預計今年底就會把相關規畫函報行政院.

_lang_en_ _attendance for inquiry. _lang_tw_ __列席備詢.
_lang_en_ _Democratic progressive party. _lang_tw_ __民主進步黨.
_lang_en_ _DPP. _lang_tw_ _民進黨.
_lang_en_ _solicit public opinion. _lang_tw_ _廣徵民意.

_新任教育部長鄭英耀27日, ___第一次到立法院教育及文化委員會列席備詢, __針對體育署升格成部的細節; 不少立委都表示關心.

民進黨立委吳沛憶, ___詢問體育署升格成部的相關期程規畫為何? 鄭英耀表示, __目前預計7月在北部; 中部; 南部; 東部舉辦分區座談, _以廣徵民意.
_對此; 吳沛憶表示贊同, _並提及《文化基本法》, ___規定文化部定期舉辦「全國文化會議」, ___她建議未來應比照辦理「全國體育會議」.
`}

//  此外, 民進黨立委林宜瑾也詢問教育部打算以什麼樣的方式將體育署升格成部? 是要修訂《行政院組織法》等相關法規,
// 朝著單獨成部的方向邁進嗎? 還是跟其他的部門合併成為一個部會? 鄭英耀坦言, 賴總統的期待是單獨成部, 但他認為目前兩種可能性都存在,
// 體育署內部也已擬定出好幾個版本, 預計年底前會將構想函報行政院.
// 鄭英耀說: 『(原音)(林宜瑾: 剛剛我看你回答沛憶委員是說, 7月要在北中南辦座談會? )目前是有這樣一個規畫.
// (林宜瑾: 是跟體育界辦座談會? )除了體育界, 還有來自於社會大眾, 因為我們希望就誠如委員所說的, 全民運動是讓全民都健康, 甚至帶來運動產業的蓬勃發展.
// (林宜瑾: 好, 那這個成立(體育暨運動發展)部的規畫大約何時會報行政院? )我們基本上目前規劃期程大概就是在年底前完成.
// (林宜瑾: OK, 期待年底前有好的消息.
// 	)』 至於體育相關預算, 教育部次長張廖萬堅表示, 從2016年到2024年, 總預算大概從70, 80億成長到130億以上的規模,
// 	而現在也正要開始編列明年的預算, 除了運動發展基金之外, 教育部也會盡量爭取公務預算, 希望體育經費能夠年年成長

// Audio: https://dts.podtrac.com/redirect.mp3/chrt.fm/track/FC2CAF/static.rti.org.tw/assets/audio/2024/04/23/ddc7a3b8692c37037a7beff89cb42e47.mp3
const 氣象署 = `
_lang_en_ _meteorological administration. _lang_tw_ _氣象署.
_lang_en_ _vigorous. _lang_tw_ _旺盛.
_lang_en_ _convective cloud system. _lang_tw_ _對流雲系.
_lang_en_ _southern edge. _lang_tw_ _南緣.
_lang_en_ _south China coast. _lang_tw_ __華南沿海.
_lang_en_ _rainfall. _lang_tw_ _降雨.

氣象署23日表示, ___目前有一道鋒面從日本西南方經過台灣北方近海, _一直延伸到華南沿海, ___而且鋒面上以及鋒面南緣都有強弱不一的對流雲系在發展, 
___比較旺盛的對流雲系則在台灣北部海面和東北部海面, 因此23日白天, _各地雖有斷斷續續的下雨, _局部地區也有較大雨勢, __但是並未出現比較劇烈的天氣.

_lang_en_ _should be noted that. _lang_tw_ _需留意的是.
_lang_en_ _thunderstorm. _lang_tw_ _雷雨.
_lang_en_ _accompany. _lang_tw_ _伴隨.
_lang_en_ _lightning strike. _lang_tw_ _雷擊.
_lang_en_ _lightning. _lang_tw_ _閃電.

需留意的是, 23日入夜後到24日, __將有大片的旺盛對流雲系進入台灣上空, __屆時除了會有陣雨或雷雨, __也可能伴隨瞬間強降雨, __甚至強陣風; 閃電; 雷擊等劇烈天氣.
___氣象預報中心簡任技正伍婉華說, __目前鋒面是經過我們北部海面, 但是今天入夜到明天, __又會有比較旺盛的對流雲系進來, _造成明顯的降雨.

_lang_en_ _local. _lang_tw_ _局部.
_lang_en_ _Matsu Islands. _lang_tw_ _馬祖.
_lang_en_ _hail. _lang_tw_ _冰雹.
_lang_en_ _tornado. _lang_tw_ _龍捲風.
_lang_en_ _senior engineer. _lang_tw_ _簡任技正.

尤其在北部, 中部, 南部的平地和山區, 會出現局部性的大雨; 另外; 金門, __馬祖和東北部的平地山區, __也容易出現比較大的雨勢.
在這種天氣情況之下, ___只要比較大片的旺盛對流雲系移進到我們的上空, __就容易帶來瞬間的強降雨, 強陣風, 閃電, 雷擊, __甚至冰雹; 龍捲風等等劇烈天氣現象.

_lang_en_ _soil and rocks are soft and fragile. _lang_tw_ __土石鬆軟脆弱.
_lang_en_ _people are urged. _lang_tw_ __呼籲民眾.
_lang_en_ _bring rain gear. _lang_tw_ __攜帶雨具.

__儘管這道鋒面25日就會離開, __但是緊接著又有另一道鋒面建立, __而且將從26日持續影響到28日.
___因此氣象署提醒; 未來一周; 天氣極不穩定, __出門時最好攜帶雨具備用, ___而且要隨時留意氣象署發布的大雨特報, __豪雨特報或大雷雨即時訊息, __尤其最近地震頻繁, 
__山區土石鬆軟脆弱, __又遇到連續降雨, ___呼籲民眾最好不要前往山區從事任何活動.

_lang_en_ _high pressure. _lang_tw_ _高壓.
_lang_en_ _hot and stuffy. _lang_tw_ __悶熱.

氣溫方面, 除了24日鋒面通過後, ___北方會有個微弱高壓稍微南下, 讓北部, 
__東北部及東部的高溫下降到攝氏25; 26度, 金門, 馬祖, 中部, __東南部也比23日稍微下降2度外, 其餘時間, 
__只要不下雨就會有些悶熱, 但是一旦下雨, __又適逢劇烈天氣; 甚至颳起強陣風, __就會覺得有涼意, __建議大家多留意這段期間的氣溫變化.
`

// 【語言S02E02】你是台灣國語還是台灣狗蟻?　一窺11種很台的發音
// https://www.mirrormedia.mg/story/20190425cul001

// _你是台灣國語還是台灣狗蟻? _一窺11種很台的發音.

// _lang_en_ _glimpse. _lang_tw_ _一窺.
// _lang_en_ _level. _lang_tw_ _層面.
// _lang_en_ _ideology. _lang_tw_ __意識型態.

// _有人認為台灣國語不標準.
// 為了教育, __在語言教學上會定出一個標準值, _讓學習者不會一頭霧水, __考試也能有準則; 但從其他層面來看,
// __標準語言的定義其實很複雜, __涉及政治; 文化和意識型態的問題.
// __所謂的標準也不斷地改變, __那麼去判斷誰講話標準; 是否真的有意義呢?

// 你覺得你講話有台灣國語嗎? 這是什麼意思呢? __今天《語言好好玩》要來談台灣國語和講話很台,
// 究竟是怎麼一回事. __在談論台灣國語的概念之前, __大家可以先想想; 當我們說台灣國語時,
// _想到的人會是誰? 你覺得哪些人說話很台?

// __若以《花甲少年轉大人》舉例, __你覺得鄭花甲還是他的爸爸有台灣國語?
// 又或者, ___近幾年的總統;李登輝; 陳水扁; 馬英九; 蔡英文, 誰有台灣國語? 誰沒有?

// _lang_en_ _apiary. _lang_tw_ _養蜂場.

// 語言學家買蜂蜜

// __語言學家去養蜂場買蜂蜜.
// _他用非常標準的口音問老闆: _請問一下; 這裡有賣蜂蜜嗎? _老闆搖了搖頭.
// ___語言學家擔心是自己的口音讓溝通有了問題, _於是改問老闆: _不好意思; 那請問你們有賣蜂蜜嗎? 老闆還是搖了頭.
// _語言學家覺得疑惑, _於是問; 那你們到底賣什麼? _老闆笑了笑; 說; 我們有賣新鮮的轟蜜哦!
// __從〈語言學家買蜂蜜〉這個笑話, _我們可以來界定台灣國語的概念.
// _其實台灣國語有2種層次, _但無論哪一種層次, ___都是源自於; 我們對於國語有個標準的想像.

// __第一種台灣國語國語此指華語或漢語的語言, _或稱台灣華語, _是相對於北京華語,
// _新加坡華語; 馬來西亞華語等概念, __其實是具有台灣腔的華語.
// 在這個概念之下, 台灣大部分人都有台灣國語, __它還是維持在所謂的標準值內,
// __住在台灣的人都會覺得它很標準; 沒有腔調, __但其他華語區的人就會覺得它有台灣腔.
// __或許可以把它比喻成澳洲腔; 愛爾蘭腔的英文.

// 第二種台灣國語, __我們可以想像成台灣國語中的台灣國語, __它受到了閩南語; 客家話等方言影響, __形成更不被視為標準的語音.
// __像是《花甲少年》的爸爸, ___陳水扁; 都會被視為這一類的代表.
// _換句話說; 第二種台灣國語, __其實是台灣當地人覺得不標準, __更具有台灣特色的台灣腔.

// _所以剛剛的笑話中, __蜂唸成被視為最標準的國語/華語, __唸的是有台灣腔的國語,
// ___唸的是具有台灣腔又帶有方言特色的國語.
// __而這些稱呼之所以會出現, __都是因為我們心中有所謂的標準.

const 台灣國語 = `
_lang_en_ _apiary. _lang_tw_ _養蜂場
從哪裡決定台灣國語? 
語言有很多層次, 詞彙; 語音; 音韻; 語法; 語義; 語用等等. 
__當我們認為某個地方有腔的時候, __在詞彙和語法上當然會有差異. 
像台灣的有字句, 例如: ___我有特別去吃了那間餐廳我有看了你說的書, 
__就會被其他華語區的人視為有台灣腔; __這種常用來表示經驗語義的有字句,
在其他的華語區不一定有, 卻是台灣華語的重要特色. 

不過, 通常大家提到台灣國語時(無論是第一種或第二種), __又以音韻最為明顯. 
__今天這集主要關注第二種台灣國語, __且要討論的是最明顯的音韻問題. 

__先來看看陳水扁2000年選前之夜的演講, __我會再藉此段說明台灣國語的音韻特色. 
音韻特色很多, __這裡先選擇出11種重要的音韻特色來談: 
__再一次的懇求大家, __明天從家裡走到投票所. 
__也許對個人來講只是一小步, __但是我們能夠一起用選票來改寫歷史, __用愛來創造歷史. 
__來完成政黨輪替, 讓民進黨執政, __絕對是我們台灣歷史民主的一大步. 
__阿扁再一次的懇求大家! 拜託各位! 讓我們一起用選票來改寫歷史, 用愛來創造歷史, 好不好! 謝謝大家, 祝福各位, 謝謝!  

特色1: 舌尖後音(捲舌音)變舌尖前音(非捲舌音)
舌尖後音(捲舌音), 陳水扁都會唸成不捲舌音(舌尖前音). 
像是「只是一小步」「創造歷史」「完成政黨輪替」等, 都沒有捲舌. 
有「台灣國語」的人常是受到閩南語與客家話等母語影響, 因為這2種方言都有沒有舌尖後音(捲舌音),
 就選擇以發音部位比較相似的舌尖前音替代. 

閩南語和客家話中也沒有「ㄖ」這個音, 常常會用或是來替代. 


特色2: 舌面前音變舌尖前音
國語中的舌面前音(ㄐㄑㄒ), 常會因為閩南語和客家話加上細音(ㄧㄩ)時不會顎化, 所以很容易把「大家」唸成「大家」. 

`

// https://guidetotaiwan.com/zh/transit/taoyuan-international-airport-mrt
// 由桃園捷運公司負責營運, _這條長51公里的路線行經桃園與新北市; 最後進入台北市, _提供從市區到機場僅需35分鐘的快速運輸捷運.

// _標準車廂每15分鐘發出一班, _所以旅客無需等待超過15分鐘等待, _下一班標準車廂或快捷車廂. _從台北出發開往桃園機場的快捷車廂,
// _或從桃園機場出發開往台北的快捷車廂每七分鐘一班. _快捷車廂標示為紫色; 標準車廂標示為藍色. _快捷車廂內部座位環境比起標準車廂相對舒適.
// _機場捷運於台北車站A1站B1, __可辦理當日班機市區預先登機服務, __通常在班機表定起飛時間前三小時必須辦理完成.
// _由於機場捷運服務時間為6點到9點半; 所以早上9點前起飛的班機, _無法辦理預先登機服務,
// _lang_en_ _on site. _lang_tw_ _現場.

// _部分航空公司可以在櫃檯預先取得登機證和辦理行李托運服務, _這些旅客到達機場後可直接通關登機.
// _預辦登機櫃台並沒有買票換票等服務, _部分航空公司可能只會在現場提供kiosk自助機服務.
// _某些特殊物品; 無法使用預先託運服務; 必須到機場才能辦理托運.
// _lang_en_ _According to normal check in procedure. _lang_tw_ __依照正常登機程續.
// _lang_en_ _transfer. _lang_tw_ _轉乘.

// _而飛往加拿大或其他不支援預先登機的航空公司, __旅客可將行李放至於車廂, __然後在機場依照正常登機程續辦理登機.
// _至於可否使用預先登機這項服務, _最終結果請詢問旅客所搭乘的航空公司; 是否有提供此服務.
// _可轉乘高速鐵路的車站A18.
// _快捷車廂與標準車廂票價相同.
// 桃園國際機場.
// _lang_en_ _tax refund up to a limit. _lang_tw_ __限額退稅.
// _lang_en_ _reach a destination. _lang_tw_ _抵達.
// _快捷車廂裡的螢幕提供當日航班資訊.
// _台北車站 A1站 提供觀光客限額退稅服務.
// _桃園機場捷運沿線每一個站均; 提供電子輪椅充電站, _行動不便者專用廁所; 也有輪椅借用服務給需要的乘客.
// _中午退房但班機起飛時間較晚的旅客, _可以選擇使用市區預先登機服務; 可減少行李負擔.
// __欲前往松山機場的旅客請不要搭乘這班捷運, __請乘坐台北捷運棕線抵達BR13站.
// _台灣規模最大的國際機場, _位置座落於大台北區域西側的桃園市內.
// _旅客可以搭乘機場捷運往返台北市區,
// 欲前往其他地區旅客, __可搭乘台灣高鐵與長途運輸巴士往返.

// _台灣島上最大的機場位於北部地區而且在台北附近, __桃園機場服務航線經由第一航廈與第二航廈, __出發飛往國際間各個終點站.
// _最主要的兩間航空公司長榮航空與中華航空; 飛往鄰國如日本; 韓國; 菲律賓, __以及港澳與中國大陸的航線分佈最為密集.
// _其他直飛長程航線則飛往美國和加拿大, _以及經由亞洲主要機場如曼谷與新加坡, __中轉飛往歐洲與其他地區之航線.
// _絕大多數旅客經由桃園國際機場入境, __其餘國際航班則飛抵台北市中心的松山機場; 花蓮; 台中或高雄.
// _lang_en_ _transit. _lang_tw_ __中轉.
// _lang_en_ _the most densely distributed. _lang_tw_ __分佈最為密集.
// _lang_en_ _remaining. _lang_tw_ __其餘.
// _lang_en_ _fly in. _lang_tw_ __飛抵.
// _lang_en_ _taxi. _lang_tw_ __計程車.
// _lang_en_ _chauffeur service. _lang_tw_ __代駕服務.

const 桃園機場捷運 = `
_lang_en_ _long distance bus. _lang_tw_ __長途運輸巴士.

_桃園國際機場擁有便捷的接駁路線網, _可選擇轉乘巴士長途客運, _機場捷運前往台北車站, __或前往桃園站下車轉乘高速鐵路. 

_前往台北的旅客通常會選擇搭乘機場捷運; 巴士或計程車, _前往台灣南部的旅客通常會選擇搭乘巴士或高鐵. 
_前往台灣東部海岸地區; 如花蓮的太魯閣和台東的旅客, _通常會前往台北車站再轉乘火車抵達. 

_lang_en_ _mass transit. _lang_tw_ __大眾轉乘運輸.

_機場位置座落於桃園市, _並位於西北向國道二號的終點, _在此可連接到國道一號與國道三號. 
_可以在機場租車; 然而考量到台灣交通駕駛情況, _建議旅客選擇大眾轉乘運輸工具或代駕服務. 

_經由桃園機場轉機至他處的旅客, ___可以在轉機空窗等待期間造訪台北市, ___許多外國旅客可以藉由免簽證方式輕易入境台灣, 
__前往市區的接駁運輸工具快速又準時. __在台北車站附近便有許多文化景點和購物區域, 
_而且台北捷運是一個, ___讓旅客方便快速抵達各個市區景點的交通工具. 

_lang_en_ _Platform. _lang_tw_ __月台.
_lang_en_ _Leaving the country. _lang_tw_ __出境.
_lang_en_ _New Taipei Industrial Park. _lang_tw_ __新北產業園區.

_部分航空公司的乘客可以在台北車站 A1, ___以及新北產業園區站 A3 台北市區西側, __兩站月台附近辦理預辦登機服務. 
__部分從桃園國際機場搭機出境的乘客, ___可以在當日班機出發時間前三小時以上預先托運行李. 
__此項服務適合中午必須退房但班機起飛時間較晚的旅客. _更多詳細預辦登機服務可參考機場捷運網頁. 

_lang_en_ _on time. _lang_tw_ __準點.

_台灣本島最快速的列車服務, __高鐵另外獨立於台灣鐵路系統, __並連結台灣西半側主要城市, ___提供快速便捷與準點的交通接駁服務. 

_lang_en_ _commuting. _lang_tw_ __通勤.
_lang_en_ _reference. _lang_tw_ __參照.

_系統設計參照日本新幹線, ___列車運行時速最高可達 300 公里每小時, ___台北至高雄之間的旅行時間最短為96分鐘即可完成. 

_lang_en_ _new type of commuting. _lang_tw_ __新型態通勤.

___2007年始提供台灣新型態通勤交通之服務, __其舒適的乘車環境, 
___與便捷到達台灣本島西半部主要城市的優點, __遂逐漸取代國內飛機航線. 

__於台北和高雄之前來回行駛, ___營運路線為單條雙向對開, __並停靠西部所有主要城市. 
____所有列車均停靠台北; 板橋; 台中以及高雄左營, __惟部分車種可能停靠更多城市. 
`

// https://guidetotaiwan.com/zh/transit/taiwan-high-speed-rail-hsr
const 高速鐵路 = `

由於沿路經過土地取得與開發不易, 大抵行經路線較偏離市中心. 而台北區段得因於鐵路地下化, 
可以與台鐵共用平行於鐵路的獨立軌道, 而高雄區段則行經高雄市中心北側的左營, 在此可連結高雄捷運以及台鐵延伸支線. 

在某些情況下, 比起乘坐高鐵, 選擇搭乘一般鐵路或長途巴士到各地主要城市反而較為方便. 
例如旅客想從台中市區前往台南市區, 雖然搭乘台鐵轉高鐵可節省約10分鐘的乘坐時間, 
如果選擇全程搭乘台鐵, 則可省去轉乘的額外不便. 

高鐵車廂採用已在日本使用的新幹線 700型再進化的設計, 通過歐洲最嚴格的安全標準檢驗, 並符合台灣當地氣候條件. 

搭乘票種可分為單程票, 通勤定期/回數票, 高鐵台鐵周遊券. 周遊券不可直接搭乘, 
需要在票券窗口櫃檯換成實體票券方可搭乘. 周遊券有時會有優惠折扣並僅提供非台灣居民的外國旅客購買. 
其他優惠如資深公民票或學生票, 須持有中華民國政府核發的有效證件或學生證方可購買. 

高鐵周遊券僅提供給非台灣居民的外國旅客: 
請提前於網路購買周遊券. 

台灣居民乘客欲使用優惠請參考信用卡優惠或提前購買早鳥票. 
`

// https://guidetotaiwan.com/zh/transit/taiwan-taoyuan-international-airport-tpe
const 桃園國際機場 = `
`

// https://guidetotaiwan.com/zh/transit/city-public-bus
const 市區公車 = `
_台灣公共汽車運輸發展非常成熟, _尤其在較大的城市, __例如台北的公車路線網, _幾乎能抵達靠近市區的任何地點. 
_除了台北捷運高雄捷運與機場捷運之外, ___台灣公共巴士均可使用電子支付方式付費, _(悠遊卡; 一卡通等等), _並提供安全便利的, __接駁服務讓旅客輕鬆往返台灣各個地點. 

_lang_en_ _Taipei metro. _lang_tw_ _臺北捷運.
_lang_en_ _connection. _lang_tw_ _接駁.
_lang_en_ _Mass Rapid Transit. _lang_tw_ _捷運.
_lang_en_ _joint operation. _lang_tw_ _聯合經營.

__幾乎所有巴士車廂內均提供華語和英文播報服務, _但由於全台灣巴士服務, __是由多個不同巴士公司聯合經營, 
_車上的廣播系統, ___並沒有像捷運與台灣鐵路有著統一標準的翻譯, ___因此建議旅客還是以華語中文站名為識別標準. 

_lang_en_ _confusion. _lang_tw_ _混淆.
_lang_en_ _according to the facts. _lang_tw_ _依據實情.
_lang_en_ _according to the facts short. _lang_tw_ _據實.
_lang_en_ _electronic ticket. _lang_tw_ __電子票證.
_lang_en_ _contactless payment. _lang_tw_ __感應支付.
_lang_en_ _divide. _lang_tw_ __劃分.
_lang_en_ _span across. _lang_tw_ __橫跨.
_lang_en_ _actual. _lang_tw_ __實際.
_lang_en_ _fare. _lang_tw_ __車資.
_next_voice_

___巴士收費均依照搭乘路線長短比例收費. __以一般市區巴士為例, ___公車路線通常被劃分為數段, 
___乘客搭乘橫跨兩段以內票價為15塊, __每多增加一段多收15塊. ___巴士上均有詳細路線分段資訊提供旅客參考. 
___其他種類巴士會根據實際距離長短收費, _例如從市區出發到九分的巴士. _對部分旅客來說, __巴士收費方式非常容易產生混淆, 
__因此強烈建議乘客使用悠遊卡等, __電子票證支付方式搭乘, __在上車與下車時感應支付, __系統會自動計算並扣除車資, _快速又方便. 

_lang_en_ _wave with one hand. _lang_tw_ _單手招手.
_lang_en_ _to dock. _lang_tw_ __停靠.
_lang_en_ _heading towards. _lang_tw_ __駛向.

_如乘客欲搭乘巴士, ___請在停靠站旁單手招手示意巴士司機停車, _如果乘客沒有招手示意, ___巴士司機很有可能不停靠直接略過駛向下一站. 

___當乘客在巴士車上欲停靠下一站並下車, _請按車廂裡的下車按鈕, __警鈴會示意司機在下一站停靠, _如乘客沒有按鈴示意; 司機有可能過站不停. 

_lang_en_ _priority seat. _lang_tw_ _愛心座位.
_lang_en_ _inspect. _lang_tw_ _查驗.
_lang_en_ _documents. _lang_tw_ _證件.
_next_voice_

_當乘客乘坐巴士時, _請注意車廂裡的愛心座位, __在台灣禮讓座位給有需要的人是一個非常普遍的行為. 

___台灣巴士提供敬老票與學生優惠票價, __當乘客欲使用優惠票價時, ___有可能被要求提供台灣所發行的證件予以查驗. 
`

// https://www.rti.org.tw/news/view/id/2172462
const 高鐵新增手機 = `
__高鐵新增手機買自由座 限站內購票.

_lang_en_ _matters. _lang_tw_ _事宜.
_lang_en_ _bring close. _lang_tw_ __攜往靠近.
_lang_en_ _signal. _lang_tw_ __訊號.
_lang_en_ _one way. _lang_tw_ __單程.

台灣高鐵公司今天表示. __即日起推出新的自由座購票方式. __乘客在出發站的車站大廳內可透過手機, _T-EX 行動購票App 購買自由座車票. 
__高鐵自由座車票原本無法預訂. __只能於搭車當天在車站內窗口, __或自動售票機購買. 
台灣高鐵今天表示. _即日起在高鐵車站內, ___可透過手機購買當日同車站出發的自由座車票. _不僅可免去排隊時間. 
___還可在完成付款後直接掃描 QR Code 進站搭車. __享受隨到; 隨買; 隨搭乘的便利服務. 
__有關手機購買自由座車票事宜. 台灣高鐵表示. __乘客透過T-EX行動購票App, _即可在車站內購買自由座車票. 
台灣高鐵指出. __乘客購票時需先開啟手機的藍牙功能. __再點選 App 中的今日自由座專區. ___系統會自動設定乘客所在車站為出發站. 
___接著選擇目的地及票種並立即完成付款後. __就可購得1張自由座車票. ___再使用購票手機中 QR Code 直接進站乘車. 
台灣高鐵提醒. __乘客使用手機購買自由座車票時. ___應將手機攜往靠近售票窗口, ___自動售票機或進站閘門等周圍區域. __即可接收訊號並使用, __T-EX行動購票App購票新功能. 
台灣高鐵表示. __乘客每次僅可透過手機 App, __購買1張單程的自由座車票. __若需同時購買去回程車票, _或多張自由座車票時. ___仍要透過站內的自動售票機或售票窗口購票. 
`

// https://www.rti.org.tw/news/view/id/2185037
// https://www.rti.org.tw/news/player/id/2185037

const 生成式AI觀察 = `
生成式AI觀察 簡立峰: 繁體中文被排擠; 日本面臨生存危機.

_lang_en_ _paradoxical. _lang_tw_ _弔詭.
_lang_en_ _offer advice. _lang_tw_ __獻策.
_lang_en_ _independent director. _lang_tw_ _獨董.
_lang_en_ _planning. _lang_tw_ _規劃.

_生成式AI快速發展下; 也產生新危機, 前Google台灣區總經理, __獨董簡立峰今天在一場演講中指出, 根據新加坡提出的報告,
繁體中文被簡體中文排擠得非常嚴重, 幾乎變成無用武之地, _但受惠於簡體中文, _台灣還可以使用, __而語言喪失能力最大的是日文跟韓文.

__工研院30日舉辦生成式AI產業高峰論壇, __邀請產官學研專家學者獻策.

_前Google台灣區總經理, __獨董簡立峰在演講時提到, _生成式AI很厲害; 但是在推理數學, ___規劃能力還有跟真實世界連結能力是不足的,
_所以他很厲害; 但卻不能完成所有事情, __對照到企業裡面的話, _可能會覺得小小一件事, _但生成式AI卻做不到, _是在一個很弔詭的階段.

_lang_en_ _software developer. _lang_tw_ _軟體工程師.
_lang_en_ _data analyst. _lang_tw_ _資料分析師.
_lang_en_ _write program. _lang_tw_ __寫程式.
_lang_en_ _decreasing birthrate. _lang_tw_ _少子化.
_next_voice_

他觀察, __初階工作者最常使用生成式AI, __用最多的地方是寫程式, _所以會衝擊, __或是說是提升軟體工程師, _資料分析師, _行銷人員,
_客服人員, _內容生成人員的能力, __目前生成式AI都還不能取代這些工作, __但能彌補未來少子化人力不足的狀況. 

他也指出, _新加坡製作的報告提到, __繁體中文被簡體中文排擠得非常嚴重, _幾乎變成無用武之地, __將是台灣該努力的地方, _但更值得一提的是, 
_生成式AI是寡占的, _缺乏多元的, _會在不知不覺中, ___會流失國家的競爭力及文化代表性, _像日本就非常緊張. 

_lang_en_ _founder and CEO. _lang_tw_ __辦人兼執行長.
_lang_en_ _weight; relative importance. _lang_tw_ __權重.
_lang_en_ _national day. _lang_tw_ _國慶日.
_lang_en_ _survived. _lang_tw_ _倖存.
_next_voice_

簡立峰提到, OpenAI的創辦人兼執行長, 
_奧特曼訪問日本時, 
__日本就要求要把日文的權重提高, 
__並說會提供訓練資料及測試資料, 
___甚至日本軟銀集團董事長孫正義直言, 
__若不做日文大型語言模型, 
__日本會面臨生存危機. 
他說, __為什麼他們會有這個緊張壓力呢? 
_因為新加坡人做了完整的測試, 
_把Open AI做完測試, 
__發現語言喪失能力最大的語言是日文跟韓文, 
_以GDP來計算, 
_我們是倖存的, 
__繁體中文的數量其實是不足的, 
_但簡體中文是高的, 
_所以我們看起來可以用, 但不是用得很好, 
__像有些時候國慶日就會搞糊塗了.

簡立峰也說; 生成式AI的
___答案絕對不是各種領域中最傑出的, 
__但已經高於一般人的能力, 
__而且使用生成式AI是需要學習的, 
_不同的問題; 答案會不一樣, 
__可能他會給別人或是你的競爭對手更好的答案. 

_lang_en_ _business leader. _lang_tw_ __企業領袖.
_lang_en_ _game. _lang_tw_ __賽局.
_next_voice_

_對企業領袖而言, 
__這將是一場新的賽局, 
_重點不是自己多快, 
_而是競爭對手有多快, 
__企業主自己就得投入使用, 他建議, 
___每個企業都要建立屬於自己的企業大腦, 
__尤其編碼; 行銷; 客戶服務, 
__要引進AI; 否則將喪失競爭力. 

`

// https://www.rti.org.tw/news/view/id/2195246
const 下罟子1 = `
_新北市下罟子渔港祈祷室开了! _外籍渔工眉开眼笑.

_lang_en_ _smiling brightly. _lang_tw_ _眉开眼笑.
_lang_en_ _diversity and inclusion. _lang_tw_ __多元共融.
_lang_en_ _create. _lang_tw_ __营造.
_lang_en_ _successively. _lang_tw_ __陆续.

_淡水区渔会秘书李名庆今天表示, __渔工们总算在今天推举出一位负责保管钥匙的人, __渔会已正式移交下罟子渔港祈祷室钥匙, __渔工们从今天起就可以开始使用祈祷室. 

__为了创造多元共融的社会, __营造友善的旅游环境, __全台各地陆续设置穆斯林祈祷室, __像是新北市下罟子渔港, __去年4月正式启用的新建渔具仓库, _里面也有一间祈祷室, 然而, _有印尼渔工表示, __祈祷室在启用典礼之后从来没有对外开放过. __淡水区渔会今天表示, __渔工们终于推选出一位负责保管钥匙的人, __从今天起就可以开始使用祈祷室了. 

`
const 下罟子2 = `_lang_en_ _ramadan. _lang_tw_ __齋戒月.

下罟子漁港在去年4月10日, __曾舉辦新建漁具倉庫的啟用典禮, __其中一個空間就是穆斯林祈禱室, 然而, __有印尼漁工今年1月31日表示, __祈禱室在啟用典禮之後就大門緊閉, _眼看齋戒月快到了, __他們希望祈禱室盡快對外開放. 

淡水區漁會秘書李名慶今天(6日)表示, 由於漁會工作人員和漁船主大多是台灣人, 不熟悉伊斯蘭教聚會, 禮拜時間以及相關規定, 所以, 希望由印尼移工自行推舉一位負責保管鑰匙的人, 由這位管理人開, 
關門去控管祈禱室的使用時間. 而今天漁工們總算推出人選, 漁會也已正式移交祈禱室鑰匙給漁工, 也就是說, 從今天起就可以開始使用祈禱室了. 
李名慶說: 『(原音)我們這邊有一些仲介, 會有一個先生幫我們服務, 當翻譯, 然後告訴他們(移工)有這樣的一個事情, 要他們要趕快集合起來, 自己趕快先討論出一個適當的人選(負責保管鑰匙)出來, 
那也可能就是在聯繫上, 離(漁會)本會比較遠一點, 所以可能這樣子有延誤到一點點時間, 那倒是沒有說不給他們使用, 只是就是還沒有找到一個適當的機制這樣子而已.  』

`

const 放弃香港音乐梦 = `
__放弃香港音乐梦; 来台湾成为汉堡王子.
_受访者; Jerry 连锁餐饮营运长.

_本集《台味超有港》的来宾Jerry, _本身在香港从事音乐工作, _在超过10年前; 他为了台湾的人和情, _决定放弃香港的音乐梦; 来台湾追寻他的梦想人生. 

$Jerry来到台湾之后, __他始终都要面对最现实的问题, _就是生活和工作. $为了生活, _Jerry来了个大转身, __从在香港做音乐换跑道到台湾的餐饮业, _经过多年的努力, __他现在已经是国际速食品牌的台湾营运长. 
__到底Jerry是怎样打开他在台湾的餐饮业之路?

_lang_en_ _taste buds. _lang_tw_ _味蕾.
_lang_en_ _COO. _lang_tw_ _营运长.
_lang_en_ _return to your roots. _lang_tw_ _落地归根.
_lang_en_ _start a family and career. _lang_tw_ _成家立业.
_lang_en_ _native born. _lang_tw_ _土生土长.

_next_voice_

_一个在香港做音乐的香港人, _来到台湾加入餐饮业, _所面对的都是台湾民众. $Jerry这个香港人, __用了什么方法去取悦台湾人的味蕾?

__Jerry已经在台湾成家立业落地归根, _他娶了台湾太太成为台湾女婿, _更育有三位小孩, _目前他的小孩都在台湾接受教育. _身为土生土长的香港人, _至少接受香港教育, Jerry又会怎么比较台湾和香港的教育制度和文化呢?

$在香港做音乐, __来到台湾加入餐饮业; 更成为汉堡王子, __这种人生转变真的是充满戏剧性, 尤其是当Jerry提及关于他的小孩在台湾接受教育的情况, _真的让我有很大的冲击. __如果你也好奇本集的节目内容, __赶快来收听本集的《台味超有港》吧!
`

// I'm from Finland. I was born in 1986. I study computer science. I visited Taiwan in spring 2024 during the Hualian earthquake. I have a master's degree in Industrial Management.
// ChatBot:
// 我來自芬蘭，出生於1986年。
// 我的主修是電腦科學。
// 2024年春天，我在花蓮地震期間造訪了台灣。
// 我擁有工業管理的碩士學位。
const 臺科大 = `
國立臺灣科技大學。
為外籍學生設計的華語能力測驗, 用來安排適合的中文課程。
所有選修華語課程的外籍生必須參加華語分級測驗, 以確定適合的學習級別。
`

const 自我介紹 = `
我來自芬蘭, 出生於1986年。
我的主修是電腦科學。
2024年春天, 我剛好在花蓮地震的時候去台灣旅行。
我在花蓮地震發生時人在台灣旅行。
去年我旅行到台灣時遇到了花蓮地震。
我擁有工業管理的碩士學位。
我已經有超過十年的工作經驗。
我在中國學習了一年半的中文。
`
