package main

import "testing"

func Test_mandarin(t *testing.T) {
	tests := []struct {
		name string
		f    func(*testing.T)
	}{
		{"generateMandarin", generateMandarinTest},
	}

	for _, tt := range tests {
		t.Run(tt.name, tt.f)
	}
}

func generateMandarinTest(t *testing.T) {
	for _, v := range []rawTextInput{{"ZJIJBLB5FSCQGWXO3TDBTBHY", "一個平常人在官場待久了, 想要涅而不縵, 是很難的。"}} {
		if err := generateMandarin(v); err != nil {
			t.Error(err)
		}
	}
}

func audioForS2() []rawTextInput {
	return []rawTextInput{
		{"tut", "我的妈妈骂我。"},
		{"ma1", "妈"},
		{"ma2", "麻"},
		{"ma3", "马"},
		{"ma4", "骂"},
		{"ma", "吗"},
		{"de", "的"},
		{"yi1", "一"},
		{"ren2", "人"},
		{"wo3", "我"},
		{"shi4", "是"},
		{"ta1", "他"},
		{"zai4", "在"},
		{"yao4", "要"},
		{"you3", "有"},
		{"wo3", "我"},
		{"ge4", "个"},
		{"zhe4", "这"},
		{"dou1", "都"},
		{"shuo1", "说"},
		{"bu4", "不"},
		{"jiu4", "就"},
		{"ren2", "人"},
		{"er2", "而"},
		{"he2", "和"},
		{"ye3", "也"},
		{"hen3", "很"},
		{"ji2", "及"},
		{"men", "们"},
		{"le", "了"},
		{"ni3", "你"},
		{"yi3", "以"},
		{"yu3", "与"},
		{"hui4", "会"},
		{"dui4", "对"},
		{"zhong3", "种"},
		{"de", "的"},
		{"da4", "大"},
		{"neng2", "能"},
		{"zhe", "着"},
		{"ta1", "她"},
		{"na4", "那"},
		{"shang4", "上"},
		{"dan4", "但"},
		{"nian2", "年"},
		{"hai2", "还"},
		{"zui4", "最"},
		{"wei2", "为"},
		{"lai2", "来"},
		{"suo3", "所"},
		{"liang3", "两"},
		{"ge4", "各"},
		{"ke3", "可"},
		{"wei2", "为"},
		{"huo4", "或"},
		{"hao3", "好"},
		{"deng3", "等"},
		{"you4", "又"},
		{"jiang1", "将"},
	}
}

// 各種句子

const 各種句子 = `
抬頭大步地離開, 不管別人。__揚長而去.

__一念之差:一個想法不對, 結果造成行為嚴重錯誤。
__低聲下氣, 因為心虛或害怕, 不敢提高聲音說話。
__他攔下一輛計程車, 揚長而去了。
__他不懂得憐香惜五, 把女友罵了.
__忙了一星期, 這篇報告總算大功告成了。

我的中文名字是桑宇浩, 桑樹的桑, 宇宙的宇, 浩大的浩。
我叫桑宇浩, 是桑樹的桑, 宇宙的宇, 浩大的浩。
我取「桑」是因為我的芬蘭姓是 Sauna-aho, 「宇浩」是從我的名字 Juha 發音來的。

內憂外患, 國家內部的動亂和外敵的侵擾。亦比喻個人所遭遇的內在糾紛與外在壓力的困境。
滿清末年, 我國遭逢內憂外患, 隨時有亡國的危險。

__我們需要好好地檢討這次活動的流程, _看看有哪些地方可以做得更好。

__偶爾在夜市會有攤販說我發音很標準。

__讀書雖然很重要，運動也很重要。
是啊!__像我這樣只曉得念書，肩不能跳不能挑，手不能提的，就糟糕了。

_lang_en_ _count you in. _lang_tw_ _算你一份.
__這次聚會我已經幫你報名了，算你一份。
__我們要去吃火鍋，算你一份喔！

__這句話 「我每次都馬說會」 是一句非常口語化的台灣中文.
__考試通過後，可以去學校領證書。
__有你的包裹在樓下，記得去領快遞。
__這個月工作特別多，終於可以領個加班費了。

__安啦 放心 不必擔心 是臺灣年輕人非正式的口語。

_lang_en_ big exam. _lang_tw_ 大考

__你不是要大考了嗎?怎麼遷出去玩?

__事到如今，你還看不清楚他的為人嗎?你還相信他? 

__他年輕時什麼都沒有，靠自己的努力在外地闖出一片天。
__他無意間聽到了他們的對話。

__「籃」和「藍」這兩個字的寫法很像，只差在一個上面是「竹字頭」，另一個是「草字頭」。
__沒有健身房，很難練好腿部。
__公園或車站常是游民的容身之處。
__看樣子，在野黨是說不過執政黨。

__盡力這個詞很有趣，因為它也可以用在諷刺的情境中。
`

// 我的自我介紹
// 大家好, 我叫桑宇浩。我是芬蘭人, 現在正在學中文。我對語言很有興趣, 也喜歡了解不同的文化。
// 「桑」這個姓是從我的芬蘭姓 Sauna-aho 來的, 而「宇浩」是根據我原本的名字 Juha 的發音來取的。我選「宇浩」這個名字, 是因為我喜歡宇宙, 覺得這個名字很有氣勢, 也符合我的個性。

// 除了語言, 我也對電腦和資料庫有興趣。我正在學習資料庫系統的結構, 像是資料庫的四大核心部分：儲存管理器、查詢處理器、交易管理器和資料庫系統管理器。這些概念對我來說很有趣, 也很實用。

// 平常我喜歡看書, 特別是科幻小說和奇幻文學。我也常聽廣播學中文, 像是臺灣的 RTI（中央廣播電臺）, 可以幫助我訓練聽力和了解臺灣文化。

// 雖然中文有時候很難, 特別是聲調和寫字, 但我會繼續努力, 希望有一天可以說得像母語人士一樣！
